In [1]:
import pandas as pd
import seaborn as sns
import matplotlib

In [68]:
df = pd.read_csv('/Users/melvinrinkleff/dev/code/22_fall_data_science/code-lu-data-science/names/yob2021.txt',
              names= ['name','gender','count'], header=None)

In [31]:
df.head

<bound method NDFrame.head of             name gender  count
0         Olivia      F  17728
1           Emma      F  15433
2      Charlotte      F  13285
3         Amelia      F  12952
4            Ava      F  12759
...          ...    ...    ...
31532     Zyeire      M      5
31533       Zyel      M      5
31534      Zyian      M      5
31535      Zylar      M      5
31536        Zyn      M      5

[31537 rows x 3 columns]>

In [32]:
df.head(10)

        name gender  count
0     Olivia      F  17728
1       Emma      F  15433
2  Charlotte      F  13285
3     Amelia      F  12952
4        Ava      F  12759
5     Sophia      F  12496
6   Isabella      F  11201
7        Mia      F  11096
8     Evelyn      F   9434
9     Harper      F   8388

In [37]:
df['count'].sum()

3361375

In [38]:
df.groupby('gender')['count'].sum()['F']

1627098

In [39]:
df.groupby('gender')['count'].sum()['M']

1734277

In [43]:
df.groupby('name')['count'].sum()['Melvin']

303

In [51]:
number_girls = df.groupby('gender')['count'].sum()['F']
number_total = df['count'].sum()

print(number_girls/number_total*100)

48.405726823100665

In [54]:
number_boys = df.groupby('gender')['count'].sum()['M']
number_total = df['count'].sum()

print(number_boys/number_total*100)

51.59427317689933

In [61]:
boysDf = df[df['gender'] == 'M']
boysDf.sort_values(by=['count'], ascending=False)
boysTop5 = boysDf.head(5)

girlsDf = df[df['gender'] == 'F']
girlsDf.sort_values(by=['count'], ascending=False)
girlsTop5 = girlsDf.head(5)

Top5 = pd.concat([boysTop5, girlsTop5]).sort_values(by=['count'], ascending=False)

            name gender  count
17544       Liam      M  20272
17545       Noah      M  18739
0         Olivia      F  17728
1           Emma      F  15433
17546     Oliver      M  14616
2      Charlotte      F  13285
3         Amelia      F  12952
4            Ava      F  12759
17547     Elijah      M  12708
17548      James      M  12367

In [67]:
pd.concat([boysTop5, girlsTop5]).sort_values(by=['count'], ascending=False).to_excel(excel_writer='So_ein_Feuerball.xlsx', index=False)